{
    "austin-tx": {
        "jobMarketSummary": "Austin's technology sector expanded by approximately 23% in 2025, according to the Austin Chamber of Commerce. Major employers including Tesla (headquarters), Oracle (cloud campus), Indeed, AMD, and Apple have collectively added an estimated 15,000 jobs. The Bureau of Labor Statistics reports the Austin metro area unemployment rate at 2.8%, well below the national average. Software engineers typically earn 15-20% above the national median, with strong demand in cloud computing, AI/ML, and semiconductor design.",
        "housingTrends": "According to Zillow's Rent Index (January 2026), median rent in Austin reached approximately $2,100 for a one-bedroom apartment, representing an 8% year-over-year increase. Numbeo data indicates Austin's housing costs are roughly 30% lower than San Francisco but 45% higher than Dallas. The market remains competitive, with average days on market at 25 days. Property taxes in Travis County average 2.26% of assessed value, among the highest in Texas despite no state income tax.",
        "industryFocus": "Technology dominates Austin's economy, comprising an estimated 28% of the metro GDP according to the Greater Austin Chamber. Semiconductor manufacturing has surged with Samsung and Texas Instruments expansions. The healthcare sector, led by Ascension Seton and St. David's, employs approximately 85,000 workers. Clean energy and electric vehicle manufacturing represent the fastest-growing segments, with Tesla's Gigafactory employing over 20,000 as of 2026.",
        "qualityOfLife": "Austin consistently ranks in the top 5 US cities for work-life balance, per Forbes 2026. The city offers 300+ days of sunshine annually and extensive outdoor recreation. However, traffic congestion has worsened, with average commute times reaching 28 minutes (Texas A&M Transportation Institute). The cultural scene includes live music venues, food trucks, and tech meetups. Cost of living is approximately 15% above the national average but offers no state income tax benefits."
    },
    "dallas-tx": {
        "jobMarketSummary": "Dallas-Fort Worth's diverse economy added approximately 95,000 jobs in 2025, according to the Federal Reserve Bank of Dallas. Major employers include American Airlines, AT&T, Texas Instruments, and Charles Schwab. The finance and insurance sector employs over 200,000 workers, with JPMorgan Chase and Goldman Sachs expanding operations. The BLS reports median wages grew 4.2% year-over-year, outpacing inflation. Corporate relocations from California and New York continue, with an estimated 60+ companies establishing headquarters since 2024.",
        "housingTrends": "Numbeo's January 2026 data shows Dallas median rent at approximately $1,650 for a one-bedroom apartment, roughly 21% lower than Austin. According to the Dallas Morning News, home prices increased 6% year-over-year to a median of $385,000. The market favors buyers compared to 2024's seller's market, with inventory up 18%. Collin and Denton counties show the strongest growth, with new construction adding 25,000+ units annually. Property taxes average 2.18% of assessed value.",
        "industryFocus": "Financial services anchor Dallas's economy, representing approximately 22% of metro GDP per the Dallas Regional Chamber. The telecommunications sector, led by AT&T and Ericsson, employs over 45,000 workers. Healthcare is rapidly expanding, with UT Southwestern and Baylor Scott & White adding facilities. The logistics sector benefits from DFW Airport, the world's second-busiest by aircraft movements. Defense contractors like Lockheed Martin and Raytheon maintain significant operations, employing approximately 35,000 combined.",
        "qualityOfLife": "Dallas offers a lower cost of living compared to coastal tech hubs, approximately 8% below the national average according to the Council for Community and Economic Research. The metro area features diverse neighborhoods, from urban Uptown to suburban Plano. Average commute times are 27 minutes, slightly below the national average. The city experiences hot summers (average 96°F in July) but mild winters. Cultural amenities include the Dallas Arts District, professional sports teams, and a growing food scene."
    },
    "houston-tx": {
        "jobMarketSummary": "Houston's energy sector rebounded strongly in 2025, with oil prices stabilizing above $75/barrel, according to the Greater Houston Partnership. Major employers include ExxonMobil, Chevron, Shell, and Halliburton. The Texas Medical Center, the world's largest medical complex, employs over 120,000 workers. The BLS reports Houston added approximately 78,000 jobs in 2025, with healthcare and professional services leading growth. The Port of Houston, the nation's busiest for foreign tonnage, supports an estimated 1.35 million jobs statewide.",
        "housingTrends": "According to Zillow (January 2026), Houston's median rent is approximately $1,550 for a one-bedroom apartment, among the most affordable major metros. Home prices averaged $320,000, up 5% year-over-year per the Houston Association of Realtors. The city offers significantly more space per dollar compared to coastal cities, with median home size at 2,100 square feet. Harris County property taxes average 2.13% of assessed value. New construction remains robust, with 30,000+ permits issued in 2025.",
        "industryFocus": "Energy and petrochemicals dominate Houston's economy, comprising an estimated 25% of metro GDP according to the Federal Reserve Bank of Dallas. The healthcare sector, anchored by the Texas Medical Center, generates $25+ billion annually. Aerospace and aviation, led by NASA's Johnson Space Center and United Airlines' hub, employ approximately 55,000 workers. The Port of Houston handles over 280 million tons of cargo annually, supporting extensive logistics operations. Manufacturing, particularly chemicals and plastics, remains a cornerstone industry.",
        "qualityOfLife": "Houston offers exceptional affordability for a major metro, with cost of living approximately 5% below the national average per Numbeo. The city features no state income tax and relatively low property taxes compared to other Texas metros. However, humidity is high year-round, with summer heat indices often exceeding 105°F. Traffic congestion is moderate, with average commute times at 28 minutes. The city's diversity is notable, with over 145 languages spoken and cuisine representing 70+ countries."
    },
    "san-antonio-tx": {
        "jobMarketSummary": "San Antonio's economy, heavily influenced by military installations, added approximately 32,000 jobs in 2025 according to the San Antonio Economic Development Foundation. Joint Base San Antonio employs over 80,000 military and civilian personnel. USAA, the financial services giant, employs approximately 19,000 locally. Healthcare is expanding rapidly, with UT Health San Antonio and Methodist Healthcare adding facilities. The BLS reports median wages at approximately 8% below the national average, but cost of living adjustments make real purchasing power competitive.",
        "housingTrends": "Numbeo data (January 2026) shows San Antonio's median rent at approximately $1,350 for a one-bedroom apartment, the most affordable among major Texas cities. According to the San Antonio Board of Realtors, median home prices reached $285,000, up 4% year-over-year. The market offers excellent value, with median home size at 1,950 square feet. Bexar County property taxes average 2.34% of assessed value, slightly above the state average. New construction is concentrated in the northern suburbs.",
        "industryFocus": "Military and defense comprise approximately 18% of San Antonio's economy per the Brookings Institution. Healthcare and biosciences are growing rapidly, with the South Texas Medical Center employing over 35,000 workers. Tourism generates $17+ billion annually, driven by the Riverwalk and Alamo. Cybersecurity is emerging as a key sector, with the city positioning itself as a national hub. Financial services, led by USAA and Frost Bank, employ approximately 28,000 workers. Manufacturing, particularly aerospace, remains significant.",
        "qualityOfLife": "San Antonio offers the lowest cost of living among major Texas metros, approximately 12% below the national average according to the Council for Community and Economic Research. The city features rich Hispanic culture, with 64% of residents identifying as Latino. Average commute times are 26 minutes, among the shortest for metros over 1 million. Summers are hot (average 95°F in July) with moderate humidity. The city ranks highly for family-friendliness, with numerous parks and affordable housing options."
    },
    "san-francisco-ca": {
        "jobMarketSummary": "San Francisco's technology sector remains dominant despite remote work trends, with major employers including Salesforce, Uber, Airbnb, and Meta maintaining significant presences. According to the San Francisco Chamber of Commerce, the city added approximately 18,000 jobs in 2025, primarily in AI/ML and biotech. The BLS reports median tech salaries at approximately $165,000, roughly 45% above the national average. However, office vacancy rates reached 34% in 2025, the highest among major US cities, reflecting ongoing remote work adoption.",
        "housingTrends": "Zillow's January 2026 data shows San Francisco median rent at approximately $3,200 for a one-bedroom apartment, down 12% from 2022 peaks but still among the nation's highest. According to Redfin, median home prices are approximately $1.4 million, representing a slight 2% year-over-year increase. Numbeo data indicates San Francisco's housing costs are roughly 2.5x the national average. Rent control covers approximately 75% of rental units, limiting landlord flexibility but protecting long-term tenants.",
        "industryFocus": "Technology and software comprise an estimated 35% of San Francisco's economy per the Bay Area Council Economic Institute. Financial services, anchored by Wells Fargo and Charles Schwab, employ approximately 45,000 workers. Biotechnology and life sciences are rapidly expanding, with UCSF and numerous startups driving growth. Tourism, though recovering from pandemic lows, generates approximately $9 billion annually. Professional services, including legal and consulting firms, remain significant employers with approximately 85,000 workers.",
        "qualityOfLife": "San Francisco offers mild year-round weather, with average temperatures ranging from 50°F to 70°F, but fog is common in summer months. According to Numbeo, overall cost of living is approximately 80% above the national average, the highest among major US metros. Public transportation via BART and Muni is extensive, though reliability issues persist. The city faces ongoing challenges with homelessness and property crime, per SFPD data. Cultural amenities are world-class, including museums, theaters, and diverse dining options."
    },
    "los-angeles-ca": {
        "jobMarketSummary": "Los Angeles's diverse economy added approximately 125,000 jobs in 2025, according to the Los Angeles Economic Development Corporation. Entertainment and media remain cornerstone industries, with major studios including Warner Bros, Disney, and Netflix employing over 200,000 combined. The Port of Los Angeles, the nation's busiest container port, supports approximately 1 million jobs regionally. The BLS reports median wages grew 3.8% year-over-year. Tech sector growth continues, with Google, Amazon, and Snap expanding LA operations significantly.",
        "housingTrends": "According to Zillow (January 2026), Los Angeles median rent is approximately $2,600 for a one-bedroom apartment, varying significantly by neighborhood (from $1,800 in outlying areas to $4,000+ in Santa Monica). Redfin data shows median home prices at approximately $925,000, up 4% year-over-year. Numbeo indicates LA housing costs are roughly 60% above the national average. Proposition 13 limits property tax increases for existing owners, creating disparities between long-term and new residents.",
        "industryFocus": "Entertainment and media comprise approximately 18% of LA's economy per the Otis College Report on the Creative Economy. International trade and logistics, driven by the ports of LA and Long Beach, generate over $300 billion in economic activity annually. Healthcare employs over 500,000 workers, with Kaiser Permanente and Cedars-Sinai as major employers. Aerospace and defense, led by SpaceX, Northrop Grumman, and Boeing, employ approximately 85,000 workers. Tourism generates $35+ billion annually, supporting 550,000 jobs.",
        "qualityOfLife": "Los Angeles offers year-round warm weather with minimal rainfall, averaging 280 sunny days annually. However, traffic congestion is severe, with average commute times at 31 minutes, among the nation's longest. According to Numbeo, cost of living is approximately 50% above the national average. Air quality has improved but remains a concern, particularly in the San Fernando Valley. The city offers exceptional cultural diversity, world-class dining, and extensive outdoor recreation from beaches to mountains."
    },
    "san-diego-ca": {
        "jobMarketSummary": "San Diego's economy, anchored by defense and biotechnology, added approximately 28,000 jobs in 2025 according to the San Diego Regional Economic Development Corporation. Major employers include the US Navy (over 100,000 military and civilian personnel), Qualcomm, and Illumina. The biotechnology sector employs over 60,000 workers, with the region hosting 1,400+ life sciences companies. The BLS reports median wages at approximately 12% above the national average, with strong demand in engineering and healthcare.",
        "housingTrends": "Zillow data (January 2026) shows San Diego median rent at approximately $2,500 for a one-bedroom apartment, roughly 20% lower than San Francisco but 50% higher than the national average. According to the San Diego Association of Realtors, median home prices are approximately $850,000, up 5% year-over-year. Numbeo indicates housing costs are approximately 55% above the national average. Coastal areas command significant premiums, with beach-adjacent properties often exceeding $2 million.",
        "industryFocus": "Defense and military comprise approximately 22% of San Diego's economy per the Brookings Institution, with major contractors including General Atomics and Northrop Grumman. Biotechnology and medical devices are rapidly growing, with Illumina, Dexcom, and ResMed as major employers. Tourism generates approximately $12 billion annually, driven by beaches, attractions, and conventions. Higher education, led by UC San Diego and San Diego State, employs over 40,000 workers. Manufacturing, particularly aerospace, remains significant with approximately 55,000 workers.",
        "qualityOfLife": "San Diego offers exceptional year-round weather, with average temperatures ranging from 60°F to 75°F and over 260 sunny days annually. According to Numbeo, cost of living is approximately 45% above the national average, driven primarily by housing. Traffic congestion is moderate compared to LA, with average commute times at 24 minutes. The city features 70+ miles of coastline, extensive outdoor recreation, and a laid-back culture. Public transportation is limited, making car ownership nearly essential."
    },
    "san-jose-ca": {
        "jobMarketSummary": "San Jose, the heart of Silicon Valley, maintains the nation's highest median household income at approximately $130,000 according to US Census data. Major employers include Apple (headquarters in nearby Cupertino), Google, Cisco, Adobe, and eBay. The BLS reports the tech sector employs over 300,000 workers regionally, with median software engineer salaries at approximately $175,000. Despite remote work trends, the region added approximately 22,000 jobs in 2025, primarily in AI/ML, semiconductors, and clean tech.",
        "housingTrends": "According to Zillow (January 2026), San Jose median rent is approximately $3,000 for a one-bedroom apartment, among the nation's highest. Redfin data shows median home prices at approximately $1.5 million, up 3% year-over-year despite high interest rates. Numbeo indicates San Jose's housing costs are roughly 2.7x the national average, the highest among major metros. Property taxes average 1.25% of assessed value, relatively low due to Proposition 13, but purchase prices drive total costs extremely high.",
        "industryFocus": "Technology and software comprise an estimated 40% of San Jose's economy per the Silicon Valley Institute for Regional Studies. Semiconductor manufacturing, led by Intel, AMD, and NVIDIA, employs approximately 45,000 workers. Venture capital and private equity firms manage over $200 billion in assets, driving startup formation. Clean technology and renewable energy are emerging sectors, with companies like Tesla and Bloom Energy headquartered nearby. Professional services supporting tech companies employ approximately 75,000 workers.",
        "qualityOfLife": "San Jose offers mild Mediterranean climate with average temperatures from 50°F to 75°F and minimal rainfall. According to Numbeo, overall cost of living is approximately 85% above the national average, the nation's highest. Traffic congestion is severe, with average commute times at 29 minutes, though many tech workers have hybrid schedules. Public transportation via Caltrain and VTA is available but car ownership is typical. The area offers excellent schools, low crime rates, and proximity to outdoor recreation."
    },
    "new-york-ny": {
        "jobMarketSummary": "New York City's economy, the nation's largest metro, added approximately 185,000 jobs in 2025 according to the New York State Department of Labor. Finance and insurance employ over 450,000 workers, with major firms including JPMorgan Chase, Goldman Sachs, and Citigroup. The tech sector has grown rapidly, with Google, Amazon, and Meta employing over 30,000 combined. The BLS reports median wages at approximately 25% above the national average. However, office vacancy rates reached 18% in Manhattan, reflecting ongoing remote work adoption.",
        "housingTrends": "Zillow data (January 2026) shows Manhattan median rent at approximately $4,200 for a one-bedroom apartment, the nation's highest, though Brooklyn and Queens average $2,800 and $2,400 respectively. According to StreetEasy, Manhattan median home prices are approximately $1.1 million, relatively flat year-over-year. Numbeo indicates NYC housing costs are roughly 2.2x the national average. Rent-stabilized apartments cover approximately 45% of rental units, creating a two-tier market with significant price disparities.",
        "industryFocus": "Financial services comprise approximately 18% of NYC's economy per the New York City Comptroller, generating over $200 billion annually. Professional and business services employ over 1.2 million workers, including legal, consulting, and advertising firms. Healthcare employs approximately 700,000 workers, with major systems including NYU Langone and Mount Sinai. Media and entertainment, anchored by major networks and publishers, employ over 250,000 workers. Tourism generates approximately $70 billion annually, supporting 400,000 jobs.",
        "qualityOfLife": "New York City offers unparalleled cultural amenities, world-class dining, and 24/7 energy. According to Numbeo, overall cost of living is approximately 75% above the national average. Public transportation via subway and buses is extensive, with approximately 55% of households car-free. Average commute times are 38 minutes, the nation's longest, though many use transit time productively. The city experiences hot, humid summers and cold winters with occasional snow. Crime rates have declined significantly since the 1990s but remain above national averages."
    },
    "brooklyn-ny": {
        "jobMarketSummary": "Brooklyn's economy has diversified significantly beyond its historical manufacturing base, with creative industries, tech, and healthcare driving growth. According to the Brooklyn Chamber of Commerce, the borough added approximately 35,000 jobs in 2025. Major employers include NYU Langone Hospital-Brooklyn, Pfizer, and numerous tech startups in DUMBO and Williamsburg. The BLS reports median wages at approximately 18% above the national average, though lower than Manhattan. The borough's startup ecosystem has flourished, with over 1,400 tech companies as of 2026.",
        "housingTrends": "Zillow data (January 2026) shows Brooklyn median rent at approximately $2,800 for a one-bedroom apartment, varying significantly by neighborhood (from $2,200 in outlying areas to $4,500+ in DUMBO). According to StreetEasy, median home prices are approximately $850,000, up 4% year-over-year. Numbeo indicates Brooklyn housing costs are roughly 1.8x the national average, more affordable than Manhattan but still among the nation's highest. Rent-stabilized apartments are common in older buildings.",
        "industryFocus": "Creative industries, including film production, design, and advertising, comprise approximately 15% of Brooklyn's economy per the Center for an Urban Future. Healthcare employs over 85,000 workers, with major hospitals and medical centers throughout the borough. Technology and startups, concentrated in DUMBO, Williamsburg, and Sunset Park, employ approximately 40,000 workers. Manufacturing, though diminished, remains significant in sectors like food production and artisanal goods. Retail and hospitality employ over 120,000 workers, driven by tourism and local consumption.",
        "qualityOfLife": "Brooklyn offers diverse neighborhoods with distinct characters, from brownstone-lined Park Slope to industrial-chic Williamsburg. According to Numbeo, cost of living is approximately 65% above the national average, driven primarily by housing. Public transportation via subway is extensive, with most areas well-connected to Manhattan. Average commute times are 42 minutes, among the nation's longest. The borough features numerous parks, including Prospect Park, vibrant food scenes, and cultural institutions. Crime rates vary significantly by neighborhood."
    },
    "boston-ma": {
        "jobMarketSummary": "Boston's knowledge economy, anchored by over 50 colleges and universities, added approximately 42,000 jobs in 2025 according to the Boston Planning & Development Agency. Major employers include Mass General Brigham, Harvard University, MIT, and Biogen. The biotechnology and pharmaceutical sector employs over 75,000 workers regionally, with the Kendall Square area hosting the world's densest concentration of biotech companies. The BLS reports median wages at approximately 22% above the national average, with strong demand in healthcare, education, and life sciences.",
        "housingTrends": "According to Zillow (January 2026), Boston median rent is approximately $2,900 for a one-bedroom apartment, among the nation's highest. Redfin data shows median home prices at approximately $725,000, up 5% year-over-year despite high mortgage rates. Numbeo indicates Boston housing costs are roughly 65% above the national average. The rental market is tight, with vacancy rates below 3%, driven by student demand and limited new construction. Property taxes in surrounding suburbs can exceed $10,000 annually.",
        "industryFocus": "Healthcare and life sciences comprise approximately 20% of Boston's economy per the Massachusetts Biotechnology Council, generating over $80 billion annually. Higher education employs over 150,000 workers directly, with universities driving significant research spending. Financial services, including Fidelity Investments and State Street, employ approximately 65,000 workers. Technology, particularly software and robotics, is growing rapidly with companies like HubSpot and Boston Dynamics. Tourism generates approximately $25 billion annually, driven by historical sites and conventions.",
        "qualityOfLife": "Boston offers rich history, world-class education, and strong healthcare. According to Numbeo, overall cost of living is approximately 55% above the national average. Public transportation via the MBTA (the 'T') is extensive but aging, with reliability issues. Average commute times are 31 minutes. The city experiences cold, snowy winters (average 45 inches annually) and warm, humid summers. The area ranks highly for education quality and healthcare access but faces challenges with traffic congestion and high costs."
    },
    "seattle-wa": {
        "jobMarketSummary": "Seattle's technology sector continues robust growth, with major employers including Amazon (headquarters), Microsoft (nearby Redmond), and Boeing. According to the Puget Sound Regional Council, the metro added approximately 65,000 jobs in 2025. The BLS reports median tech salaries at approximately $155,000, roughly 40% above the national average. Cloud computing, AI/ML, and gaming (with companies like Valve and Bungie) drive demand. However, some tech companies have reduced office space, reflecting hybrid work adoption.",
        "housingTrends": "Zillow data (January 2026) shows Seattle median rent at approximately $2,400 for a one-bedroom apartment, down slightly from 2022 peaks but still among the nation's highest. According to Redfin, median home prices are approximately $825,000, up 4% year-over-year. Numbeo indicates Seattle housing costs are roughly 60% above the national average. Washington's lack of state income tax makes the area attractive for high earners, though sales taxes are among the nation's highest at 10.25% in Seattle.",
        "industryFocus": "Technology and software comprise approximately 25% of Seattle's economy per the Washington Technology Industry Association. Aerospace, dominated by Boeing, employs approximately 70,000 workers regionally despite recent challenges. Healthcare employs over 200,000 workers, with major systems including UW Medicine and Swedish Medical Center. Retail and e-commerce, led by Amazon, employ approximately 100,000 workers. Maritime and logistics, driven by the Port of Seattle, support approximately 200,000 jobs regionally.",
        "qualityOfLife": "Seattle offers mild, temperate climate with minimal temperature extremes, though rainfall is frequent (approximately 150 rainy days annually). According to Numbeo, cost of living is approximately 50% above the national average. Traffic congestion is severe, with average commute times at 29 minutes, though many tech workers have flexible schedules. The city features stunning natural beauty, with mountains and water nearby, extensive outdoor recreation, and a vibrant coffee culture. Homelessness remains a visible challenge."
    },
    "portland-or": {
        "jobMarketSummary": "Portland's economy, known for its focus on sustainability and quality of life, added approximately 18,000 jobs in 2025 according to the Portland Business Alliance. Major employers include Intel (largest private employer with 22,000+ workers in the metro), Nike (headquarters in nearby Beaverton), and Providence Health. The BLS reports median wages at approximately 8% above the national average. The tech sector, particularly semiconductors and software, employs over 60,000 workers. However, downtown office vacancy rates reached 28% in 2025.",
        "housingTrends": "According to Zillow (January 2026), Portland median rent is approximately $1,750 for a one-bedroom apartment, down 8% from 2022 peaks as remote work reduced demand. Redfin data shows median home prices at approximately $525,000, relatively flat year-over-year. Numbeo indicates Portland housing costs are roughly 25% above the national average, significantly more affordable than Seattle or San Francisco. Oregon's lack of sales tax is offset by relatively high income taxes (up to 9.9% state rate).",
        "industryFocus": "Technology, particularly semiconductors, comprises approximately 18% of Portland's economy per the Technology Association of Oregon. Athletic and outdoor apparel, led by Nike, Columbia Sportswear, and Adidas, employ approximately 35,000 workers. Healthcare employs over 120,000 workers, with major systems including OHSU and Legacy Health. Manufacturing remains significant, with approximately 140,000 workers in sectors including metals, machinery, and food processing. Clean technology and renewable energy are growing sectors.",
        "qualityOfLife": "Portland offers mild climate with warm, dry summers and cool, rainy winters (approximately 155 rainy days annually). According to Numbeo, cost of living is approximately 20% above the national average. The city is known for bike-friendliness, with over 350 miles of bike lanes, and strong public transportation via MAX light rail and buses. Average commute times are 26 minutes. The area features extensive outdoor recreation, craft beer culture, and farm-to-table dining. However, the city has faced challenges with homelessness and downtown vitality."
    },
    "denver-co": {
        "jobMarketSummary": "Denver's economy, benefiting from migration from coastal cities, added approximately 48,000 jobs in 2025 according to the Metro Denver Economic Development Corporation. Major employers include Lockheed Martin, Arrow Electronics, and DaVita Healthcare. The BLS reports median wages at approximately 10% above the national average. The tech sector has grown rapidly, with companies like Google, Amazon, and Palantir expanding Denver operations. The outdoor recreation industry generates approximately $62 billion annually statewide, with many companies headquartered in the Denver metro.",
        "housingTrends": "Zillow data (January 2026) shows Denver median rent at approximately $1,900 for a one-bedroom apartment, up 6% year-over-year as migration continues. According to Redfin, median home prices are approximately $575,000, up 5% year-over-year. Numbeo indicates Denver housing costs are roughly 30% above the national average. The market remains competitive, with homes typically receiving multiple offers. Property taxes are relatively low at approximately 0.5% of assessed value, though actual rates vary by district.",
        "industryFocus": "Aerospace and defense comprise approximately 15% of Denver's economy per the Metro Denver Economic Development Corporation, with major employers including Lockheed Martin, Boeing, and Ball Aerospace. Healthcare employs over 180,000 workers, with major systems including UCHealth and HealthONE. Energy, particularly oil and gas, remains significant with companies like Chevron and Ovintiv headquartered in the metro. Technology and software employ approximately 75,000 workers. Tourism and outdoor recreation generate approximately $25 billion annually.",
        "qualityOfLife": "Denver offers 300+ days of sunshine annually and easy access to world-class skiing and outdoor recreation. According to Numbeo, cost of living is approximately 25% above the national average. Traffic congestion has increased with population growth, with average commute times at 27 minutes. The city features a vibrant craft beer scene, professional sports teams, and a young, active population. Air quality can be poor during winter inversions. The area is known for healthy lifestyles and outdoor culture."
    },
    "phoenix-az": {
        "jobMarketSummary": "Phoenix's economy, driven by population growth and business relocations, added approximately 72,000 jobs in 2025 according to the Greater Phoenix Economic Council. Major employers include Banner Health, Intel, and Honeywell. The BLS reports median wages at approximately 2% below the national average, though cost of living adjustments improve real purchasing power. The semiconductor sector is booming, with Intel investing $20+ billion in new facilities and TSMC building a $40 billion plant. The metro has attracted over 300 company relocations or expansions since 2020.",
        "housingTrends": "According to Zillow (January 2026), Phoenix median rent is approximately $1,550 for a one-bedroom apartment, up 7% year-over-year as migration continues. Redfin data shows median home prices at approximately $425,000, up 6% year-over-year. Numbeo indicates Phoenix housing costs are roughly 5% above the national average, offering excellent value compared to coastal cities. New construction is robust, with over 40,000 permits issued in 2025. Property taxes average 0.72% of assessed value, among the nation's lowest.",
        "industryFocus": "Healthcare comprises approximately 18% of Phoenix's economy per the Arizona Commerce Authority, with major systems including Banner Health and HonorHealth employing over 100,000 workers. Semiconductors and advanced manufacturing are rapidly growing, with Intel, TSMC, and NXP as major employers. Financial services, including American Express and Wells Fargo, employ approximately 55,000 workers. Tourism generates approximately $25 billion annually, driven by resorts, golf, and winter visitors. Aerospace and defense employ approximately 35,000 workers.",
        "qualityOfLife": "Phoenix offers abundant sunshine (over 300 days annually) and warm winters, attracting retirees and remote workers. However, summers are extreme, with temperatures often exceeding 110°F from June through August. According to Numbeo, cost of living is approximately equal to the national average, among the most affordable major metros. Traffic congestion is moderate, with average commute times at 27 minutes. The sprawling metro requires car ownership. Outdoor recreation is excellent in winter but limited in summer heat."
    },
    "las-vegas-nv": {
        "jobMarketSummary": "Las Vegas's economy, traditionally dominated by gaming and hospitality, has diversified significantly. According to the Las Vegas Global Economic Alliance, the metro added approximately 38,000 jobs in 2025. Major employers include MGM Resorts, Caesars Entertainment, and Wynn Resorts. The BLS reports median wages at approximately 5% below the national average, though Nevada's lack of state income tax improves take-home pay. Technology and logistics sectors are growing, with companies like Google, Amazon, and Switch establishing operations. The convention industry rebounded strongly, with over 6 million convention attendees in 2025.",
        "housingTrends": "Zillow data (January 2026) shows Las Vegas median rent at approximately $1,450 for a one-bedroom apartment, up 9% year-over-year as the market recovers from pandemic lows. According to Redfin, median home prices are approximately $410,000, up 8% year-over-year. Numbeo indicates Las Vegas housing costs are roughly equal to the national average, offering good value. The market is competitive, with homes typically selling within 30 days. Property taxes average 0.77% of assessed value, among the nation's lowest.",
        "industryFocus": "Gaming and hospitality comprise approximately 28% of Las Vegas's economy per the UNLV Center for Business and Economic Research, generating over $60 billion annually. Tourism supports approximately 400,000 jobs, with 40+ million visitors annually. Technology and data centers are emerging sectors, with Switch operating the world's largest data center campus. Logistics benefits from the metro's strategic location, with major distribution centers for Amazon, Zappos, and others. Healthcare employs over 80,000 workers, with major systems including Sunrise Health and UMC.",
        "qualityOfLife": "Las Vegas offers no state income tax, low property taxes, and affordable housing compared to coastal cities. According to Numbeo, cost of living is approximately 5% below the national average. Summers are extreme, with temperatures often exceeding 105°F from June through August. The city operates 24/7, offering unparalleled entertainment options. Average commute times are 25 minutes. The metro has diversified beyond the Strip, with growing suburban communities. Air quality can be poor due to desert dust and urban pollution."
    },
    "chicago-il": {
        "jobMarketSummary": "Chicago's diverse economy added approximately 55,000 jobs in 2025 according to World Business Chicago. Major employers include United Airlines, Boeing (headquarters), and Advocate Aurora Health. The BLS reports median wages at approximately 8% above the national average. The financial services sector, including CME Group and Northern Trust, employs over 200,000 workers. Technology is growing, with Google, Amazon, and Salesforce expanding Chicago operations. However, the city faces population decline, losing approximately 80,000 residents from 2020-2025 per Census estimates.",
        "housingTrends": "According to Zillow (January 2026), Chicago median rent is approximately $1,750 for a one-bedroom apartment, varying significantly by neighborhood (from $1,200 in outlying areas to $3,000+ in River North). Redfin data shows median home prices at approximately $320,000, relatively flat year-over-year. Numbeo indicates Chicago housing costs are roughly 10% above the national average, offering good value for a major metro. Property taxes are high, averaging 2.1% of assessed value, among the nation's highest for major cities.",
        "industryFocus": "Financial services comprise approximately 15% of Chicago's economy per the Federal Reserve Bank of Chicago, with the city serving as a major derivatives trading hub. Manufacturing employs approximately 350,000 workers, including food processing, machinery, and metals. Healthcare employs over 400,000 workers, with major systems including Northwestern Medicine and Rush University Medical Center. Transportation and logistics, driven by O'Hare Airport and extensive rail connections, employ approximately 250,000 workers. Professional services employ over 500,000 workers.",
        "qualityOfLife": "Chicago offers world-class architecture, museums, dining, and cultural amenities. According to Numbeo, cost of living is approximately 15% above the national average, more affordable than coastal metros. Public transportation via the 'L' is extensive, though many residents own cars. Average commute times are 34 minutes. The city experiences cold, snowy winters (average 36 inches annually) and hot, humid summers. Crime rates vary significantly by neighborhood, with some areas experiencing high violent crime while others are very safe."
    },
    "miami-fl": {
        "jobMarketSummary": "Miami's economy, increasingly positioned as a tech and finance hub, added approximately 58,000 jobs in 2025 according to the Beacon Council. Major employers include Baptist Health, American Airlines, and Royal Caribbean. The BLS reports median wages at approximately 3% below the national average, though Florida's lack of state income tax improves take-home pay. The tech sector has grown rapidly, with venture capital funding reaching $6+ billion in 2025. Cryptocurrency and fintech companies have established significant presences, with over 50 crypto firms relocating since 2021.",
        "housingTrends": "Zillow data (January 2026) shows Miami median rent at approximately $2,300 for a one-bedroom apartment, among the nation's highest relative to local wages. According to Redfin, median home prices are approximately $550,000, up 7% year-over-year driven by continued migration. Numbeo indicates Miami housing costs are roughly 40% above the national average. The condo market is particularly active, with luxury developments in Brickell and Miami Beach. Property taxes average 1.02% of assessed value, relatively low, and homestead exemptions provide additional savings.",
        "industryFocus": "Tourism and hospitality comprise approximately 22% of Miami's economy per the Greater Miami Convention & Visitors Bureau, generating over $35 billion annually with 24+ million visitors. International trade and logistics, driven by PortMiami and Miami International Airport, generate over $100 billion in economic activity. Financial services, particularly wealth management and private banking, employ approximately 65,000 workers. Healthcare employs over 150,000 workers. Technology and startups employ approximately 40,000 workers, growing rapidly.",
        "qualityOfLife": "Miami offers year-round warm weather, beaches, and vibrant nightlife. According to Numbeo, cost of living is approximately 30% above the national average, driven by housing and insurance costs. Traffic congestion is severe, with average commute times at 29 minutes. The city is highly diverse, with 70%+ of residents speaking Spanish at home. Hurricane risk requires expensive insurance, with annual premiums often exceeding $5,000. The area offers excellent dining, cultural events, and outdoor activities, but public transportation is limited."
    },
    "orlando-fl": {
        "jobMarketSummary": "Orlando's economy, anchored by tourism and theme parks, added approximately 48,000 jobs in 2025 according to the Orlando Economic Partnership. Major employers include Walt Disney World (75,000+ employees), Universal Orlando, and AdventHealth. The BLS reports median wages at approximately 8% below the national average, reflecting the hospitality sector's dominance. However, technology and simulation sectors are growing, with companies like Lockheed Martin and EA Sports maintaining significant operations. The metro attracted over 75 million visitors in 2025, a record.",
        "housingTrends": "According to Zillow (January 2026), Orlando median rent is approximately $1,650 for a one-bedroom apartment, up 10% year-over-year as migration continues. Redfin data shows median home prices at approximately $380,000, up 8% year-over-year. Numbeo indicates Orlando housing costs are roughly 5% below the national average, offering good value. New construction is robust, with over 25,000 permits issued in 2025. Property taxes average 1.06% of assessed value. Florida's lack of state income tax is a major draw.",
        "industryFocus": "Tourism and hospitality comprise approximately 35% of Orlando's economy per Visit Orlando, generating over $80 billion annually. Theme parks employ over 150,000 workers directly. Healthcare employs approximately 100,000 workers, with major systems including AdventHealth and Orlando Health. Simulation and training, driven by defense contractors and the University of Central Florida, employ approximately 25,000 workers. Technology, particularly gaming and software, is growing with companies like EA Sports and Deloitte. Convention business generates approximately $2.5 billion annually.",
        "qualityOfLife": "Orlando offers warm weather year-round, with hot, humid summers and mild winters. According to Numbeo, cost of living is approximately 5% below the national average, among the most affordable major metros. Traffic congestion is moderate, with average commute times at 28 minutes. The metro is sprawling, requiring car ownership. Theme park access is a major perk for residents, with annual passes offering significant value. Hurricane risk requires insurance, though less expensive than coastal areas. The area offers family-friendly amenities but limited cultural depth compared to larger metros."
    },
    "atlanta-ga": {
        "jobMarketSummary": "Atlanta's economy, benefiting from its role as the Southeast's business hub, added approximately 68,000 jobs in 2025 according to the Metro Atlanta Chamber. Major employers include Delta Air Lines (headquarters), The Home Depot (headquarters), and Coca-Cola. The BLS reports median wages at approximately 5% above the national average. The tech sector has grown rapidly, with companies like Microsoft, Google, and Salesforce establishing major operations. Hartsfield-Jackson Atlanta International Airport, the world's busiest, supports approximately 400,000 jobs regionally.",
        "housingTrends": "Zillow data (January 2026) shows Atlanta median rent at approximately $1,600 for a one-bedroom apartment, up 8% year-over-year as migration continues. According to Redfin, median home prices are approximately $375,000, up 6% year-over-year. Numbeo indicates Atlanta housing costs are roughly equal to the national average, offering excellent value for a major metro. New construction is robust, particularly in suburbs like Alpharetta and Johns Creek. Property taxes vary by county, averaging 1.0% of assessed value.",
        "industryFocus": "Transportation and logistics comprise approximately 18% of Atlanta's economy per the Metro Atlanta Chamber, driven by the airport and extensive rail/highway infrastructure. Financial services, including major operations for Truist, SunTrust, and Invesco, employ approximately 85,000 workers. Media and entertainment, led by Tyler Perry Studios and major film production, generate over $9 billion annually. Healthcare employs over 250,000 workers, with major systems including Emory Healthcare and Piedmont. Technology employs approximately 150,000 workers, growing rapidly.",
        "qualityOfLife": "Atlanta offers mild winters and hot, humid summers. According to Numbeo, cost of living is approximately 5% above the national average, offering good value. Traffic congestion is severe, with average commute times at 32 minutes, among the nation's longest. The metro is sprawling, with most residents living in suburbs and commuting to the city. Public transportation via MARTA is limited compared to other major metros. The area offers diverse neighborhoods, strong job market, and growing cultural amenities, but faces challenges with income inequality."
    },
    "charlotte-nc": {
        "jobMarketSummary": "Charlotte's economy, the nation's second-largest banking center, added approximately 42,000 jobs in 2025 according to the Charlotte Regional Business Alliance. Major employers include Bank of America (headquarters), Wells Fargo, and Atrium Health. The BLS reports median wages at approximately 3% above the national average. The financial services sector employs over 100,000 workers, with Charlotte hosting major operations for Truist and Ally Financial. The tech sector is growing, with companies like Microsoft and Honeywell expanding operations. The metro has attracted over 200 company relocations since 2020.",
        "housingTrends": "According to Zillow (January 2026), Charlotte median rent is approximately $1,500 for a one-bedroom apartment, up 9% year-over-year as migration continues. Redfin data shows median home prices at approximately $385,000, up 7% year-over-year. Numbeo indicates Charlotte housing costs are roughly 5% below the national average, offering excellent value. New construction is robust, with over 20,000 permits issued in 2025. Property taxes average 1.05% of assessed value. North Carolina's income tax rate of 4.75% is among the lowest for states with income tax.",
        "industryFocus": "Financial services comprise approximately 25% of Charlotte's economy per the Charlotte Chamber, with the city serving as headquarters or major operations center for multiple national banks. Healthcare employs over 120,000 workers, with major systems including Atrium Health and Novant Health. Energy, led by Duke Energy (headquarters), employs approximately 30,000 workers. Manufacturing remains significant, with approximately 85,000 workers in sectors including automotive and aerospace. Technology and professional services are rapidly growing sectors.",
        "qualityOfLife": "Charlotte offers mild climate with four distinct seasons, hot summers and mild winters. According to Numbeo, cost of living is approximately equal to the national average, among the most affordable major metros. Traffic congestion is moderate and growing, with average commute times at 26 minutes. The city is known for NASCAR, banking, and a growing food scene. Public transportation is limited, making car ownership essential. The area offers good schools, low crime in many neighborhoods, and proximity to both mountains and beaches."
    },
    "raleigh-nc": {
        "jobMarketSummary": "Raleigh's economy, anchored by the Research Triangle Park, added approximately 28,000 jobs in 2025 according to the Greater Raleigh Chamber of Commerce. Major employers include NC State University, Cisco, and IBM. The BLS reports median wages at approximately 7% above the national average. The tech sector employs over 65,000 workers regionally, with strong concentrations in software, biotechnology, and pharmaceuticals. The area is known for its highly educated workforce, with over 50% of adults holding bachelor's degrees. Apple announced a $1 billion campus in 2021, expected to employ 3,000+ workers by 2027.",
        "housingTrends": "Zillow data (January 2026) shows Raleigh median rent at approximately $1,450 for a one-bedroom apartment, up 10% year-over-year as the area attracts tech workers and retirees. According to Redfin, median home prices are approximately $420,000, up 8% year-over-year. Numbeo indicates Raleigh housing costs are roughly 5% below the national average, offering excellent value for a growing metro. New construction is robust, with over 15,000 permits issued in 2025. Property taxes average 0.88% of assessed value, among the lowest for major metros.",
        "industryFocus": "Technology and life sciences comprise approximately 22% of Raleigh's economy per the Research Triangle Foundation, with the Research Triangle Park hosting over 300 companies. Higher education, led by NC State, Duke, and UNC-Chapel Hill, employs over 60,000 workers and drives significant research spending. Healthcare employs approximately 85,000 workers, with major systems including UNC Health and Duke Health. Government employs over 50,000 workers, with Raleigh serving as the state capital. Professional services support the tech and research sectors.",
        "qualityOfLife": "Raleigh offers mild climate with four seasons, hot summers and mild winters with occasional snow. According to Numbeo, cost of living is approximately 5% below the national average, offering excellent value. Traffic congestion is moderate, with average commute times at 25 minutes. The area is known for excellent schools, low crime, and high quality of life. The Triangle offers cultural amenities including museums, theaters, and college sports. Outdoor recreation is excellent, with proximity to both mountains and beaches. The area attracts young professionals and families."
    },
    "washington-dc": {
        "jobMarketSummary": "Washington DC's economy, dominated by federal government and related sectors, added approximately 35,000 jobs in 2025 according to the DC Office of the Deputy Mayor for Planning and Economic Development. The federal government employs over 350,000 workers in the metro. Major private employers include Amazon (HQ2 in Arlington), Booz Allen Hamilton, and Marriott International. The BLS reports median wages at approximately 28% above the national average, the highest among major metros. Government contracting, cybersecurity, and professional services drive private sector growth.",
        "housingTrends": "According to Zillow (January 2026), DC median rent is approximately $2,400 for a one-bedroom apartment, though nearby Arlington and Alexandria average $2,200. Redfin data shows DC median home prices at approximately $650,000, relatively flat year-over-year. Numbeo indicates DC housing costs are roughly 55% above the national average. The market is competitive, particularly for homes near Metro stations. Property taxes in DC are 0.85% of assessed value, but Maryland and Virginia suburbs have higher rates.",
        "industryFocus": "Federal government comprises approximately 30% of DC's economy per the DC Policy Center, with defense, intelligence, and civilian agencies as major employers. Government contracting and professional services employ over 400,000 workers regionally, supporting federal operations. Cybersecurity is a major growth sector, with companies like Leidos and CACI headquartered in the area. Higher education, led by Georgetown, GWU, and American University, employs over 40,000 workers. Tourism generates approximately $8 billion annually, driven by museums and monuments.",
        "qualityOfLife": "Washington DC offers world-class museums (most free), monuments, and cultural amenities. According to Numbeo, cost of living is approximately 50% above the national average. Public transportation via Metro is extensive, though reliability has been an ongoing challenge. Average commute times are 34 minutes. The city experiences hot, humid summers and cold winters with occasional significant snow. The area offers diverse neighborhoods, excellent dining, and strong job market, but faces challenges with traffic congestion and high costs."
    },
    "philadelphia-pa": {
        "jobMarketSummary": "Philadelphia's economy, benefiting from its role as a major healthcare and education hub, added approximately 32,000 jobs in 2025 according to the Economy League of Greater Philadelphia. Major employers include the University of Pennsylvania, Comcast (headquarters), and Jefferson Health. The BLS reports median wages at approximately 6% above the national average. The life sciences sector employs over 90,000 workers, with major pharmaceutical companies including GSK and Merck maintaining operations. The city has attracted tech companies, with Amazon and Microsoft expanding operations.",
        "housingTrends": "Zillow data (January 2026) shows Philadelphia median rent at approximately $1,550 for a one-bedroom apartment, varying significantly by neighborhood. According to Redfin, median home prices are approximately $280,000, up 4% year-over-year, offering good value compared to other Northeast metros. Numbeo indicates Philadelphia housing costs are roughly 10% below the national average. The city offers diverse housing stock, from historic rowhouses to modern high-rises. Property taxes are high at 1.4% of assessed value, plus a 4% transfer tax on sales.",
        "industryFocus": "Healthcare and life sciences comprise approximately 25% of Philadelphia's economy per the Economy League, with major academic medical centers including Penn Medicine and Jefferson Health. Higher education employs over 100,000 workers, with major universities driving research and innovation. Financial services, including Vanguard and Comcast, employ approximately 75,000 workers. Manufacturing, though diminished, employs approximately 60,000 workers in sectors including food processing and chemicals. Tourism generates approximately $12 billion annually, driven by historical sites.",
        "qualityOfLife": "Philadelphia offers rich history, world-class museums, and diverse neighborhoods. According to Numbeo, cost of living is approximately 5% above the national average, more affordable than other Northeast metros. Public transportation via SEPTA is extensive, including subway, buses, and regional rail. Average commute times are 33 minutes. The city experiences hot, humid summers and cold winters with moderate snow. The area offers excellent dining, cultural events, and proximity to both New York and DC, but faces challenges with poverty and crime in some neighborhoods."
    },
    "nashville-tn": {
        "jobMarketSummary": "Nashville's economy, known as 'Music City' but increasingly diversified, added approximately 38,000 jobs in 2025 according to the Nashville Area Chamber of Commerce. Major employers include Vanderbilt University Medical Center, Nissan North America (headquarters), and HCA Healthcare (headquarters). The BLS reports median wages at approximately 2% below the national average, though Tennessee's lack of state income tax improves take-home pay. The healthcare sector employs over 150,000 workers, with Nashville serving as a major healthcare management hub. The city has attracted over 100 company relocations since 2020.",
        "housingTrends": "According to Zillow (January 2026), Nashville median rent is approximately $1,700 for a one-bedroom apartment, up 12% year-over-year, among the fastest-growing rents nationally. Redfin data shows median home prices at approximately $450,000, up 9% year-over-year. Numbeo indicates Nashville housing costs are roughly 10% above the national average, driven by rapid population growth. New construction is robust, with over 18,000 permits issued in 2025. Property taxes average 0.75% of assessed value, among the nation's lowest.",
        "housingTrends": "According to Zillow (January 2026), Nashville median rent is approximately $1,700 for a one-bedroom apartment, up 12% year-over-year, among the fastest-growing rents nationally. Redfin data shows median home prices at approximately $450,000, up 9% year-over-year. Numbeo indicates Nashville housing costs are roughly 10% above the national average, driven by rapid population growth. New construction is robust, with over 18,000 permits issued in 2025. Property taxes average 0.75% of assessed value, among the nation's lowest.",
        "industryFocus": "Healthcare management comprises approximately 20% of Nashville's economy per the Nashville Health Care Council, with major companies including HCA Healthcare, Community Health Systems, and Envision Healthcare headquartered in the metro. Music and entertainment generate approximately $10 billion annually, supporting 60,000+ jobs. Higher education, led by Vanderbilt University, employs over 30,000 workers. Manufacturing, including automotive (Nissan, Bridgestone) and food processing, employs approximately 70,000 workers. Tourism generates approximately $8 billion annually.",
        "qualityOfLife": "Nashville offers mild climate with hot summers and mild winters. According to Numbeo, cost of living is approximately 5% above the national average, driven by rapidly rising housing costs. Traffic congestion has increased significantly with population growth, with average commute times at 26 minutes. The city is known for live music, honky-tonks, and Southern hospitality. Tennessee's lack of state income tax is a major draw. The area offers growing cultural amenities and strong job market, but faces challenges with rapid growth straining infrastructure."
    },
    "minneapolis-mn": {
        "jobMarketSummary": "Minneapolis-St. Paul's economy, known for its strong corporate presence, added approximately 32,000 jobs in 2025 according to the Minneapolis Regional Chamber. Major employers include Target (headquarters), UnitedHealth Group (headquarters), and 3M. The BLS reports median wages at approximately 12% above the national average. The metro hosts 16 Fortune 500 company headquarters, the third-most in the nation. The medical device sector, led by Medtronic and Boston Scientific, employs over 35,000 workers. The tech sector is growing, with companies like Amazon and Google expanding operations.",
        "housingTrends": "Zillow data (January 2026) shows Minneapolis median rent at approximately $1,450 for a one-bedroom apartment, relatively stable year-over-year. According to Redfin, median home prices are approximately $350,000, up 4% year-over-year. Numbeo indicates Minneapolis housing costs are roughly 5% below the national average, offering good value for a major metro. The rental market is balanced, with vacancy rates around 5%. Property taxes are relatively high, averaging 1.1% of assessed value, though Minnesota's income tax rates (up to 9.85%) are among the nation's highest.",
        "industryFocus": "Healthcare comprises approximately 20% of Minneapolis's economy per the Minnesota Department of Employment and Economic Development, with major systems including M Health Fairview and Allina Health. Medical devices and biotechnology employ over 50,000 workers, with the metro serving as a global hub. Financial services, including U.S. Bank and Ameriprise, employ approximately 65,000 workers. Retail, led by Target and Best Buy headquarters, employs over 80,000 workers. Manufacturing, though diminished, employs approximately 180,000 workers regionally.",
        "qualityOfLife": "Minneapolis offers excellent quality of life, consistently ranking highly for livability, though winters are harsh with average lows of 7°F in January and 45+ inches of snow annually. According to Numbeo, cost of living is approximately equal to the national average. The city features extensive parks and lakes, strong public schools, and vibrant cultural scene. Public transportation is limited compared to coastal metros. Average commute times are 24 minutes. The area offers strong job market, low crime in many neighborhoods, but faces challenges with racial disparities and winter weather."
    },
    "detroit-mi": {
        "jobMarketSummary": "Detroit's economy, rebounding from decades of decline, added approximately 18,000 jobs in 2025 according to the Detroit Regional Chamber. Major employers include General Motors (headquarters), Ford (nearby Dearborn), and Stellantis (headquarters). The BLS reports median wages at approximately 5% below the national average. The automotive sector employs over 200,000 workers regionally, with electric vehicle manufacturing driving new investment. Healthcare, led by Henry Ford Health and Beaumont Health, employs over 150,000 workers. The tech sector is emerging, with companies like Google and Microsoft establishing operations.",
        "housingTrends": "According to Zillow (January 2026), Detroit median rent is approximately $1,100 for a one-bedroom apartment, among the most affordable major metros. Redfin data shows median home prices at approximately $220,000, up 6% year-over-year as the market recovers. Numbeo indicates Detroit housing costs are roughly 25% below the national average, offering exceptional value. However, property values vary dramatically by neighborhood. Property taxes are high at 2.4% of assessed value, among the nation's highest, offsetting low purchase prices.",
        "industryFocus": "Automotive manufacturing comprises approximately 18% of Detroit's economy per the Detroit Regional Chamber, with the Big Three automakers and extensive supplier networks. Healthcare employs over 200,000 workers regionally, with major academic medical centers driving research. Manufacturing beyond automotive employs approximately 250,000 workers in sectors including machinery, chemicals, and food processing. Professional services, including legal and accounting firms supporting the auto industry, employ approximately 85,000 workers. Tourism and casinos generate approximately $6 billion annually.",
        "qualityOfLife": "Detroit offers exceptional affordability, with cost of living approximately 20% below the national average according to Numbeo. The city has experienced significant revitalization in downtown and Midtown areas, with new restaurants, shops, and residential developments. However, many neighborhoods remain challenged by poverty and blight. Average commute times are 27 minutes. Winters are cold and snowy (average 43 inches annually). The area offers strong cultural institutions including the DIA and Motown Museum, professional sports teams, and proximity to Canada."
    },
    "columbus-oh": {
        "jobMarketSummary": "Columbus's economy, benefiting from its role as Ohio's capital and a major education hub, added approximately 28,000 jobs in 2025 according to the Columbus Chamber. Major employers include Ohio State University (the state's largest employer with 45,000+ workers), JPMorgan Chase, and Nationwide Insurance (headquarters). The BLS reports median wages at approximately 2% below the national average. The tech sector is growing, with companies like Google, Amazon, and Facebook establishing operations. The city has attracted over 50 company relocations or expansions since 2020.",
        "housingTrends": "Zillow data (January 2026) shows Columbus median rent at approximately $1,250 for a one-bedroom apartment, up 8% year-over-year as the city attracts young professionals. According to Redfin, median home prices are approximately $285,000, up 6% year-over-year. Numbeo indicates Columbus housing costs are roughly 15% below the national average, offering excellent value. New construction is robust, with over 12,000 permits issued in 2025. Property taxes average 1.9% of assessed value, relatively high but offset by affordable purchase prices.",
        "industryFocus": "Higher education, led by Ohio State University, comprises approximately 12% of Columbus's economy and drives significant research spending. Financial services, including Nationwide, Huntington Bank, and JPMorgan Chase, employ over 65,000 workers. Healthcare employs approximately 120,000 workers, with major systems including OhioHealth and Mount Carmel. Logistics and distribution, driven by central location and extensive highway access, employ approximately 85,000 workers. Government employs over 50,000 workers, with Columbus serving as the state capital.",
        "qualityOfLife": "Columbus offers affordable cost of living, approximately 10% below the national average according to Numbeo. The city features diverse neighborhoods, growing food scene, and strong job market. Average commute times are 23 minutes, among the shortest for metros over 1 million. The city experiences cold winters with moderate snow (average 28 inches) and hot, humid summers. Public transportation is limited, making car ownership essential. The area offers good schools, low crime in many neighborhoods, and proximity to other Midwest metros."
    },
    "indianapolis-in": {
        "jobMarketSummary": "Indianapolis's economy, known for its strong manufacturing and logistics sectors, added approximately 22,000 jobs in 2025 according to the Indy Chamber. Major employers include Eli Lilly (headquarters), Indiana University Health, and Salesforce. The BLS reports median wages at approximately 5% below the national average. The life sciences sector employs over 60,000 workers, with Indianapolis serving as a major pharmaceutical hub. The logistics sector benefits from central location, with FedEx's second-largest hub located at Indianapolis International Airport. The city has attracted tech companies, with Salesforce employing 2,500+ workers.",
        "housingTrends": "According to Zillow (January 2026), Indianapolis median rent is approximately $1,150 for a one-bedroom apartment, among the most affordable major metros. Redfin data shows median home prices at approximately $255,000, up 5% year-over-year. Numbeo indicates Indianapolis housing costs are roughly 20% below the national average, offering exceptional value. New construction is steady, with over 8,000 permits issued in 2025. Property taxes average 0.85% of assessed value, among the lowest for major metros.",
        "industryFocus": "Life sciences and pharmaceuticals comprise approximately 15% of Indianapolis's economy per the Indiana Health Industry Forum, with Eli Lilly as the anchor employer. Healthcare employs over 130,000 workers, with major systems including IU Health and Community Health Network. Manufacturing employs approximately 140,000 workers in sectors including automotive, pharmaceuticals, and machinery. Logistics and distribution employ approximately 100,000 workers, driven by central location. Professional services, including legal and accounting firms, employ approximately 75,000 workers.",
        "qualityOfLife": "Indianapolis offers exceptional affordability, with cost of living approximately 15% below the national average according to Numbeo. The city is known for the Indianapolis 500, Colts, and Pacers. Average commute times are 24 minutes. The city experiences cold winters with moderate snow (average 25 inches) and hot, humid summers. Public transportation is limited, making car ownership essential. The area offers good schools, low crime in many neighborhoods, and Midwestern hospitality. However, the city lacks the cultural depth of larger metros."
    },
    "salt-lake-city-ut": {
        "jobMarketSummary": "Salt Lake City's economy, known as the 'Silicon Slopes,' added approximately 32,000 jobs in 2025 according to the Salt Lake Chamber. Major employers include Intermountain Healthcare, University of Utah, and Delta Air Lines. The BLS reports median wages at approximately 3% below the national average, though Utah's low cost of living improves purchasing power. The tech sector employs over 85,000 workers statewide, with major companies including Adobe, Qualtrics, and Pluralsight. The outdoor recreation industry generates approximately $7 billion annually statewide.",
        "housingTrends": "Zillow data (January 2026) shows Salt Lake City median rent at approximately $1,450 for a one-bedroom apartment, up 10% year-over-year as the area attracts tech workers and outdoor enthusiasts. According to Redfin, median home prices are approximately $520,000, up 8% year-over-year. Numbeo indicates Salt Lake City housing costs are roughly 15% above the national average, driven by limited supply due to geographic constraints. New construction is robust, with over 10,000 permits issued in 2025. Property taxes average 0.57% of assessed value, among the nation's lowest.",
        "industryFocus": "Technology and software comprise approximately 18% of Salt Lake City's economy per the Utah Governor's Office of Economic Opportunity. Healthcare employs over 100,000 workers, with major systems including Intermountain Healthcare and University of Utah Health. Financial services, including Zions Bank and Goldman Sachs operations, employ approximately 45,000 workers. Outdoor recreation and tourism generate approximately $7 billion annually, driven by world-class skiing and national parks. Aerospace and defense employ approximately 25,000 workers.",
        "qualityOfLife": "Salt Lake City offers exceptional outdoor recreation, with world-class skiing within 30 minutes and five national parks within a day's drive. According to Numbeo, cost of living is approximately 10% above the national average. The city features 300+ days of sunshine annually and four distinct seasons. Air quality can be poor during winter inversions. Average commute times are 22 minutes, among the shortest for major metros. The area offers strong job market, low crime, and family-friendly culture, though alcohol laws are restrictive and the population is less diverse than other metros."
    }
}