{
    "software-engineer": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), software engineers earn a median annual salary of approximately $135,000, with the top 10% exceeding $200,000. Employment is projected to grow 22% from 2025 to 2030, much faster than the average for all occupations. Demand is particularly strong in cloud computing, artificial intelligence, and cybersecurity. Geographic salary variations are significant: San Francisco and Seattle typically offer 40-50% premiums over the national median, while Austin and Denver provide 15-25% premiums. Remote work options have expanded, with an estimated 60% of software engineers working hybrid or fully remote as of 2026.",
        "skillRequirements": "Most positions require a bachelor's degree in computer science or related field, though approximately 25% of engineers are self-taught or bootcamp graduates. Key technical skills include proficiency in languages like Python, Java, or JavaScript, version control (Git), and cloud platforms (AWS, Azure, GCP). Soft skills such as problem-solving and communication are increasingly valued. Certifications like AWS Solutions Architect or Google Cloud Professional can boost earning potential by 10-15%. Experience with AI/ML frameworks (TensorFlow, PyTorch) is becoming standard for senior roles.",
        "careerGrowth": "Career progression typically follows: Junior Engineer (0-2 years, $80K-$110K) → Mid-level Engineer (3-5 years, $120K-$160K) → Senior Engineer (6-10 years, $160K-$220K) → Staff/Principal Engineer or Engineering Manager (10+ years, $220K-$350K+). Total compensation often includes equity, especially at tech companies, adding 20-40% to base salary. Lateral moves into product management, data science, or technical leadership are common. The field offers strong long-term prospects, with the BLS projecting sustained demand through 2035."
    },
    "data-scientist": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports data scientists earn a median annual salary of approximately $130,000, with experienced professionals in major tech hubs earning $180K-$250K. Employment is projected to grow 36% from 2025 to 2030, one of the fastest-growing occupations. Demand is driven by AI/ML adoption across industries, with particularly strong growth in healthcare, finance, and e-commerce. Geographic variations are pronounced, with San Francisco, New York, and Seattle offering 35-45% premiums. According to LinkedIn data, approximately 40% of data scientists work remotely or hybrid as of 2026.",
        "skillRequirements": "Most positions require a master's degree in data science, statistics, computer science, or related quantitative field, though exceptional candidates with bachelor's degrees and strong portfolios can succeed. Essential technical skills include Python or R, SQL, machine learning libraries (scikit-learn, TensorFlow, PyTorch), and data visualization tools (Tableau, PowerBI). Statistical knowledge and experimental design are critical. Cloud platform experience (AWS SageMaker, Google Cloud AI) is increasingly required. Strong communication skills to translate technical findings to non-technical stakeholders are highly valued.",
        "careerGrowth": "Typical progression: Junior Data Scientist (0-2 years, $90K-$120K) → Data Scientist (3-5 years, $130K-$170K) → Senior Data Scientist (6-10 years, $170K-$230K) → Principal Data Scientist or ML Engineering Manager (10+ years, $230K-$400K+). Many transition into specialized roles like ML Engineer, Data Engineering, or Analytics Leadership. The field offers excellent long-term prospects, with McKinsey estimating a shortage of 250,000 data professionals through 2030. Total compensation at tech companies often includes significant equity."
    },
    "product-manager": {
        "nationalOutlook": "According to Glassdoor and Levels.fyi data (2025), product managers earn a median annual salary of approximately $145,000, with senior PMs at major tech companies earning $200K-$350K total compensation. The BLS projects 10% growth for management occupations through 2030. Demand is particularly strong in technology, fintech, and healthcare sectors. Geographic salary variations are significant, with San Francisco, Seattle, and New York offering 40-55% premiums over the national median. Approximately 50% of product managers work hybrid schedules as of 2026, per LinkedIn data.",
        "skillRequirements": "Most positions require a bachelor's degree, with MBA or technical degrees providing advantages. Essential skills include product strategy, user research, data analysis, and stakeholder management. Technical product managers benefit from coding knowledge (SQL, Python) and understanding of software development processes. Proficiency with product management tools (Jira, Asana, Figma) is expected. Strong communication, prioritization, and cross-functional leadership skills are critical. Certifications like Pragmatic Institute or Product School can be beneficial but are not required.",
        "careerGrowth": "Career path typically follows: Associate Product Manager (0-2 years, $100K-$130K) → Product Manager (3-5 years, $140K-$180K) → Senior Product Manager (6-10 years, $180K-$250K) → Director/VP of Product (10+ years, $250K-$500K+). Many PMs transition from engineering, consulting, or business analyst roles. The role offers excellent long-term prospects, with increasing recognition of product management as a critical function. Total compensation at tech companies often includes significant equity, with some senior PMs earning $400K+ total comp."
    },
    "web-developer": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports web developers earn a median annual salary of approximately $85,000, with experienced full-stack developers in major metros earning $110K-$150K. Employment is projected to grow 23% from 2025 to 2030, much faster than average. Demand is strong across all industries as companies prioritize digital presence. Geographic variations exist, with San Francisco and New York offering 30-40% premiums, though remote work has reduced location dependency. According to Stack Overflow's 2025 survey, approximately 65% of web developers work remotely at least part-time.",
        "skillRequirements": "Many web developers are self-taught or bootcamp graduates, though bachelor's degrees in computer science provide advantages. Essential skills include HTML, CSS, JavaScript, and at least one modern framework (React, Vue, Angular). Backend developers need proficiency in languages like Node.js, Python, or PHP, plus database knowledge (SQL, MongoDB). Version control (Git), responsive design, and web accessibility standards are expected. Cloud deployment experience (AWS, Netlify, Vercel) is increasingly common. Portfolio demonstrating real projects is often more important than formal credentials.",
        "careerGrowth": "Typical progression: Junior Web Developer (0-2 years, $60K-$80K) → Web Developer (3-5 years, $85K-$115K) → Senior Web Developer (6-10 years, $115K-$150K) → Lead Developer or Engineering Manager (10+ years, $150K-$220K+). Many specialize in frontend, backend, or full-stack development. Lateral moves into UX engineering, DevOps, or mobile development are common. The field offers strong prospects, with every company needing web presence. Freelance and contract opportunities are abundant, with experienced developers earning $100-$200/hour."
    },
    "registered-nurse": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), registered nurses earn a median annual salary of approximately $82,000, with experienced nurses in specialized units or major metros earning $95K-$120K. Employment is projected to grow 6% from 2025 to 2030, adding approximately 200,000 jobs. Demand is driven by aging population and healthcare expansion. Geographic variations are significant, with California, Massachusetts, and Hawaii offering the highest wages (often $100K+), while Southern states typically pay 20-30% below the national median. Travel nursing offers premium pay, with contracts often paying $2,000-$3,000 per week.",
        "skillRequirements": "All RNs must hold either an Associate Degree in Nursing (ADN) or Bachelor of Science in Nursing (BSN) and pass the NCLEX-RN exam for licensure. BSN is increasingly preferred or required, with many hospitals requiring BSN within 3-5 years of hire. Specialization certifications (Critical Care, Emergency, Oncology) can increase earning potential by 10-20%. Essential skills include clinical assessment, medication administration, patient education, and electronic health records proficiency. Soft skills like empathy, communication, and stress management are critical.",
        "careerGrowth": "Career progression: New Graduate RN (0-1 year, $65K-$75K) → Experienced RN (2-5 years, $80K-$95K) → Charge Nurse or Specialized RN (6-10 years, $95K-$115K) → Nurse Manager or Advanced Practice RN (10+ years, $115K-$150K+). Many pursue advanced degrees to become Nurse Practitioners (median $120K), Nurse Anesthetists (median $200K+), or Nurse Midwives (median $115K). The field offers excellent job security, with the BLS projecting sustained demand through 2035. Flexible scheduling and diverse specialties provide career variety."
    },
    "pharmacist": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports pharmacists earn a median annual salary of approximately $125,000, with hospital pharmacists and those in specialized roles earning $135K-$155K. Employment is projected to decline slightly (approximately 2%) from 2025 to 2030 due to automation and mail-order pharmacy growth. However, demand remains strong in clinical pharmacy, specialty medications, and rural areas. Geographic variations are moderate, with California, Alaska, and Vermont offering the highest wages. According to pharmacy workforce studies, approximately 15% of pharmacists work part-time, offering schedule flexibility.",
        "skillRequirements": "All pharmacists must complete a Doctor of Pharmacy (PharmD) degree (typically 6-8 years total including undergraduate prerequisites) and pass the NAPLEX and state-specific exams for licensure. Residencies (1-2 years post-graduation) are increasingly common and often required for hospital positions. Essential skills include medication therapy management, drug interaction assessment, patient counseling, and pharmacy management systems. Specialization certifications (Oncology, Cardiology, Ambulatory Care) can enhance career prospects. Strong attention to detail and communication skills are critical.",
        "careerGrowth": "Career path: Staff Pharmacist (0-3 years, $115K-$130K) → Clinical Pharmacist or Pharmacy Manager (4-8 years, $130K-$145K) → Director of Pharmacy or Specialized Clinical Pharmacist (9+ years, $145K-$165K+). Some pursue additional training to become Board Certified Pharmacotherapy Specialists (BCPS) or specialize in areas like oncology or infectious disease. The field faces challenges from automation and retail consolidation, but clinical pharmacy roles in hospitals and specialty areas offer strong prospects. Work-life balance is generally good, with predictable schedules in most settings."
    },
    "physical-therapist": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), physical therapists earn a median annual salary of approximately $95,000, with experienced PTs in outpatient orthopedics or specialized settings earning $105K-$125K. Employment is projected to grow 14% from 2025 to 2030, much faster than average, driven by aging population and increased emphasis on mobility and pain management. Geographic variations exist, with Nevada, California, and Alaska offering the highest wages. According to APTA data, approximately 25% of PTs work part-time, and many have flexible schedules.",
        "skillRequirements": "All physical therapists must complete a Doctor of Physical Therapy (DPT) degree (typically 7 years total including undergraduate) and pass the National Physical Therapy Exam (NPTE) for licensure. Clinical rotations during school provide hands-on experience. Specialization certifications (Orthopedics, Sports, Neurology) can increase earning potential and career opportunities. Essential skills include manual therapy techniques, exercise prescription, patient assessment, and documentation. Strong interpersonal skills and empathy are critical for patient motivation and compliance.",
        "careerGrowth": "Typical progression: New Graduate PT (0-2 years, $75K-$85K) → Physical Therapist (3-7 years, $90K-$105K) → Senior PT or Clinical Specialist (8-15 years, $105K-$120K) → Clinic Director or Private Practice Owner (15+ years, $120K-$180K+). Many pursue board certification in specialties, which can command premium rates. Private practice ownership offers highest earning potential but requires business acumen. The field offers excellent work-life balance, with most PTs working standard business hours. Job satisfaction is high, with meaningful patient interactions."
    },
    "teacher": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports elementary and secondary teachers earn median annual salaries of approximately $65,000, with significant variation by state and district. New York, California, and Massachusetts offer the highest average salaries (often $80K-$95K), while Southern states typically pay 30-40% below the national median. Employment is projected to grow 4% from 2025 to 2030, about average. However, teacher shortages persist in STEM subjects, special education, and rural areas. According to NEA data, the average teacher has 14 years of experience, and approximately 8% leave the profession annually.",
        "skillRequirements": "All teachers must hold at least a bachelor's degree in education or subject area, plus state teaching certification/licensure. Many states require master's degrees within 5-10 years of initial certification. Essential skills include lesson planning, classroom management, differentiated instruction, and assessment. Technology integration (Google Classroom, Canvas, educational apps) is increasingly important. Specializations like ESL, special education, or STEM subjects can improve job prospects and earning potential. Strong communication and patience are critical.",
        "careerGrowth": "Career progression: Beginning Teacher (0-3 years, $45K-$55K) → Experienced Teacher (4-10 years, $60K-$75K) → Master Teacher or Department Head (11-20 years, $75K-$90K) → Assistant Principal or Curriculum Specialist (20+ years, $90K-$110K+). Salary increases are typically based on years of experience and education level (bachelor's vs. master's vs. doctorate). Many teachers pursue National Board Certification, which can add $5K-$10K annually. The field offers excellent benefits (health insurance, pension), job security, and summers off, though work-life balance during school year can be challenging."
    },
    "police-officer": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), police officers earn a median annual salary of approximately $70,000, with officers in major metros and those with seniority earning $85K-$110K. California, New Jersey, and Alaska offer the highest average wages. Employment is projected to grow 3% from 2025 to 2030, about average, though many departments face recruitment challenges. Geographic variations are significant, with large cities typically offering higher base pay plus overtime opportunities. According to Police Executive Research Forum data, approximately 20% of officers work significant overtime, substantially increasing total compensation.",
        "skillRequirements": "Requirements vary by department but typically include high school diploma (some require associate's or bachelor's degrees), age 21+, US citizenship, clean criminal record, and physical fitness standards. All officers must complete police academy training (typically 6 months) and field training. Essential skills include de-escalation, report writing, firearms proficiency, and emergency response. Many departments value military experience or college degrees in criminal justice. Specialized training (K-9, SWAT, detective work) can enhance career prospects. Strong judgment, communication, and stress management are critical.",
        "careerGrowth": "Career path: Patrol Officer (0-5 years, $55K-$75K) → Senior Officer or Detective (6-12 years, $75K-$95K) → Sergeant (13-18 years, $95K-$115K) → Lieutenant or Captain (19+ years, $115K-$145K+). Promotion typically requires written exams, interviews, and performance evaluations. Many specialize in areas like investigations, narcotics, or community policing. The field offers strong benefits including pension (often 50-75% of salary after 20-25 years), health insurance, and job security. However, the work involves significant stress, irregular hours, and physical danger."
    },
    "accountant": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports accountants and auditors earn a median annual salary of approximately $79,000, with CPAs and those in senior roles earning $95K-$130K. Employment is projected to grow 4% from 2025 to 2030, about average. Demand is steady across all industries, with particularly strong growth in healthcare, technology, and financial services. Geographic variations exist, with New York, California, and DC offering 20-30% premiums. According to AICPA data, approximately 650,000 CPAs are licensed in the US, and the profession faces a talent shortage with fewer students entering the field.",
        "skillRequirements": "Most positions require a bachelor's degree in accounting or related field. CPA licensure (requiring 150 credit hours, passing the CPA exam, and 1-2 years experience) significantly enhances earning potential and career prospects, with CPAs earning 10-20% more than non-CPAs. Essential skills include financial reporting, tax preparation, audit procedures, and accounting software (QuickBooks, SAP, Oracle). Advanced Excel and data analytics skills are increasingly important. Attention to detail, analytical thinking, and communication skills are critical.",
        "careerGrowth": "Typical progression: Staff Accountant (0-2 years, $55K-$70K) → Senior Accountant (3-5 years, $75K-$95K) → Accounting Manager (6-10 years, $95K-$120K) → Controller or Director of Accounting (11+ years, $120K-$180K+). Many pursue CPA licensure and specialize in areas like tax, audit, or forensic accounting. Public accounting offers faster advancement but longer hours (especially during tax season), while corporate accounting typically offers better work-life balance. The field provides stable career prospects and clear advancement paths."
    },
    "project-manager": {
        "nationalOutlook": "According to the Project Management Institute (PMI) and BLS data (2025), project managers earn a median annual salary of approximately $105,000, with PMs in technology, construction, and healthcare earning $120K-$160K. Employment is projected to grow 6% from 2025 to 2030. Demand is strong across all industries as organizations increasingly adopt project-based work. Geographic variations are significant, with San Francisco, New York, and Seattle offering 30-40% premiums. According to PMI, approximately 25 million new project management professionals will be needed globally through 2030.",
        "skillRequirements": "Most positions require a bachelor's degree, with technical degrees or MBAs providing advantages. PMP (Project Management Professional) certification from PMI significantly enhances career prospects and earning potential (10-20% salary premium). Essential skills include project planning, risk management, stakeholder communication, and budget management. Proficiency with project management tools (MS Project, Jira, Asana) is expected. Industry-specific knowledge (construction, IT, healthcare) is often required. Strong leadership, organization, and problem-solving skills are critical.",
        "careerGrowth": "Career path: Associate Project Manager (0-2 years, $70K-$90K) → Project Manager (3-6 years, $100K-$130K) → Senior Project Manager (7-12 years, $130K-$165K) → Program Manager or Director of PMO (13+ years, $165K-$220K+). Many transition from technical roles (engineering, IT) into project management. The field offers excellent long-term prospects, with increasing recognition of project management as a critical competency. Certifications like PMP, Agile, or Six Sigma enhance career advancement. Work-life balance varies significantly by industry."
    },
    "marketing-manager": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports marketing managers earn a median annual salary of approximately $155,000, with managers at major brands or tech companies earning $180K-$250K+. Employment is projected to grow 6% from 2025 to 2030. Demand is particularly strong for digital marketing expertise, with skills in SEO, social media, and marketing analytics commanding premium salaries. Geographic variations are significant, with San Francisco, New York, and Los Angeles offering 35-45% premiums. According to LinkedIn data, approximately 40% of marketing managers work hybrid schedules as of 2026.",
        "skillRequirements": "Most positions require a bachelor's degree in marketing, business, or communications, with MBAs providing advantages for senior roles. Essential skills include digital marketing (SEO, SEM, social media), marketing analytics (Google Analytics, Tableau), content strategy, and brand management. Proficiency with marketing automation tools (HubSpot, Marketo, Salesforce) is increasingly required. Data analysis skills and ability to demonstrate ROI are critical. Strong creativity, communication, and strategic thinking are essential.",
        "careerGrowth": "Typical progression: Marketing Coordinator (0-2 years, $50K-$65K) → Marketing Manager (3-6 years, $80K-$120K) → Senior Marketing Manager (7-10 years, $130K-$180K) → Director of Marketing or CMO (11+ years, $180K-$350K+). Many specialize in areas like digital marketing, brand management, or product marketing. The field offers excellent long-term prospects, with marketing increasingly recognized as revenue-driving function. Total compensation at tech companies often includes significant equity. Work-life balance varies, with agency roles typically more demanding than in-house positions."
    },
    "sales-representative": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), sales representatives earn median annual salaries ranging from $65,000 (retail/wholesale) to $95,000 (technical/scientific products), with top performers earning $150K-$300K+ including commissions. Employment is projected to grow 2% from 2025 to 2030, slower than average, as e-commerce reduces need for some sales roles while increasing demand for technical sales. Geographic variations exist, with major metros offering higher base salaries. According to sales industry studies, approximately 60% of compensation is typically base salary, with 40% commission, though this varies significantly by industry.",
        "skillRequirements": "Requirements vary widely by industry. Technical sales roles often require bachelor's degrees in engineering or related fields, while other sales positions may only require high school diplomas. Essential skills include prospecting, relationship building, negotiation, and closing techniques. CRM proficiency (Salesforce, HubSpot) is expected. Industry knowledge is critical, particularly in technical or B2B sales. Strong communication, resilience, and self-motivation are essential. Many companies provide extensive sales training programs.",
        "careerGrowth": "Career path: Sales Development Representative (0-2 years, $45K-$65K) → Account Executive (3-5 years, $75K-$120K) → Senior Account Executive (6-10 years, $120K-$180K) → Sales Manager or Director (11+ years, $150K-$250K+). Top performers can earn significantly more through commissions and bonuses. Many transition into sales management, business development, or account management roles. The field offers unlimited earning potential for high performers, though income can be volatile. Work-life balance varies, with quota pressure creating stress but also flexibility in schedule management."
    },
    "real-estate-agent": {
        "nationalOutlook": "According to the National Association of Realtors (NAR) and BLS data (2025), real estate agents earn median annual incomes of approximately $60,000, though this varies dramatically based on market, experience, and effort. Top performers in major metros earn $150K-$500K+, while part-time agents may earn $20K-$40K. The field is highly commission-based, with agents typically earning 2.5-3% of sale price. Employment is projected to grow 3% from 2025 to 2030. The profession is highly cyclical, with income closely tied to housing market conditions. According to NAR, approximately 1.5 million real estate agents are licensed in the US.",
        "skillRequirements": "All agents must complete state-required pre-licensing education (typically 60-90 hours), pass a state exam, and maintain active licensure through continuing education. No college degree is required, making real estate accessible career change option. Essential skills include market knowledge, negotiation, marketing, and client relationship management. Technology proficiency (MLS systems, CRM, social media marketing) is increasingly important. Many successful agents invest heavily in personal branding and lead generation. Strong communication, persistence, and self-motivation are critical.",
        "careerGrowth": "Career progression is less structured than traditional careers: New Agent (0-2 years, $20K-$50K) → Established Agent (3-7 years, $60K-$120K) → Top Producer (8+ years, $150K-$500K+). Many specialize in residential, commercial, luxury, or investment properties. Some transition into brokerage ownership or property management. The field offers unlimited earning potential and schedule flexibility, but income is unpredictable and many agents fail in first 2 years. Success requires significant self-investment in marketing, networking, and lead generation. Work-life balance is challenging, with evening and weekend work common."
    },
    "electrician": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports electricians earn a median annual salary of approximately $65,000, with experienced electricians in commercial/industrial settings or union positions earning $80K-$95K. Employment is projected to grow 6% from 2025 to 2030, driven by construction growth and renewable energy installations. Geographic variations are significant, with Alaska, New York, and Illinois offering the highest wages (often $85K-$100K+). According to IBEW data, union electricians typically earn 20-30% more than non-union counterparts and receive stronger benefits. Overtime is common, with many electricians earning $75K-$90K including OT.",
        "skillRequirements": "Most electricians complete 4-5 year apprenticeships combining classroom instruction (144+ hours annually) with on-the-job training (2,000+ hours annually). High school diploma or GED is required. All electricians must obtain state licensure (journeyman or master electrician). Essential skills include electrical code knowledge (NEC), blueprint reading, troubleshooting, and safety procedures. Specializations like industrial controls, solar installation, or low-voltage systems can increase earning potential. Physical fitness and comfort working in various conditions (heights, confined spaces) are required.",
        "careerGrowth": "Career path: Apprentice Electrician (0-4 years, $35K-$50K) → Journeyman Electrician (5-10 years, $60K-$80K) → Master Electrician (11+ years, $80K-$100K+) → Electrical Contractor or Shop Owner (varies, $100K-$200K+). Many specialize in residential, commercial, or industrial work. Business ownership offers highest earning potential but requires business management skills. The field offers excellent job security, with skilled electricians in high demand. Physical demands increase with age, though many transition to supervisory or estimating roles. Benefits are typically strong, especially in union positions."
    },
    "plumber": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), plumbers earn a median annual salary of approximately $65,000, with experienced plumbers in commercial settings or business owners earning $80K-$120K+. Employment is projected to grow 5% from 2025 to 2030, about average. Demand is steady, driven by new construction, aging infrastructure, and building code requirements. Geographic variations exist, with Alaska, Illinois, and Massachusetts offering the highest wages. According to industry data, self-employed plumbers and those running small businesses often earn significantly more than wage employees. Emergency and overtime work can add 20-30% to base income.",
        "skillRequirements": "Most plumbers complete 4-5 year apprenticeships combining classroom instruction with on-the-job training (similar to electricians). High school diploma or GED is required. State licensure (journeyman or master plumber) is required in most states. Essential skills include pipe fitting, blueprint reading, plumbing code knowledge, and problem-solving. Specializations like medical gas systems, fire sprinklers, or green plumbing can increase earning potential. Physical fitness and comfort working in challenging conditions (crawl spaces, weather) are required. Customer service skills are important for residential plumbers.",
        "careerGrowth": "Typical progression: Apprentice Plumber (0-4 years, $35K-$50K) → Journeyman Plumber (5-10 years, $60K-$80K) → Master Plumber (11+ years, $80K-$100K+) → Plumbing Contractor or Business Owner (varies, $100K-$250K+). Many specialize in residential service, commercial construction, or industrial maintenance. Business ownership offers highest earning potential, with successful plumbing businesses generating $500K-$2M+ in revenue. The field offers excellent job security and recession resistance (plumbing emergencies occur regardless of economy). Physical demands are significant, though many transition to supervisory or estimating roles with experience."
    },
    "truck-driver": {
        "nationalOutlook": "The Bureau of Labor Statistics (May 2025) reports heavy truck drivers earn a median annual salary of approximately $55,000, with long-haul drivers earning $60K-$75K and specialized drivers (hazmat, oversized loads) earning $75K-$95K+. Employment is projected to grow 4% from 2025 to 2030. The industry faces ongoing driver shortages, with the American Trucking Associations estimating a shortage of 80,000 drivers in 2025. Geographic variations are moderate, with Alaska, New York, and Nevada offering the highest wages. Owner-operators can earn $100K-$150K+ but face significant expenses and business risks.",
        "skillRequirements": "All commercial truck drivers must obtain a Commercial Driver's License (CDL), requiring passing written and road tests. Class A CDL (for tractor-trailers) is most common and valuable. Many drivers attend truck driving schools (4-8 weeks) before entering the field. Essential skills include safe driving, route planning, vehicle inspection, and log book management (electronic logging devices). Endorsements for hazmat, tanker, or doubles/triples can increase earning potential by 10-20%. Clean driving record and ability to pass DOT physical exams are required. Long-haul driving requires extended time away from home.",
        "careerGrowth": "Career path: Entry-level Driver (0-2 years, $45K-$55K) → Experienced Driver (3-7 years, $55K-$70K) → Specialized Driver or Trainer (8+ years, $70K-$90K+) → Owner-Operator or Fleet Manager (varies, $80K-$150K+). Many drivers start with large carriers and transition to smaller companies or owner-operator status. Specializations like hazmat, refrigerated goods, or oversized loads command premium rates. The field offers accessible entry (minimal education requirements) and steady demand, but involves long hours, time away from family, and health challenges from sedentary work. Automation may impact long-haul driving in coming decades."
    },
    "lawyer": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (May 2025), lawyers earn a median annual salary of approximately $145,000, with significant variation by practice area and firm size. Corporate lawyers at major firms earn $190K-$400K+ (including bonuses), while public defenders and legal aid lawyers earn $60K-$80K. Employment is projected to grow 8% from 2025 to 2030, faster than average. Demand is particularly strong in intellectual property, healthcare law, and corporate compliance. Geographic variations are extreme, with New York, California, and DC offering the highest salaries. According to NALP data, approximately 75% of law school graduates find legal employment within 10 months of graduation.",
        "skillRequirements": "All lawyers must complete a bachelor's degree, graduate from an ABA-accredited law school (3 years), and pass the bar exam in their state. Total education is typically 7 years post-high school. Essential skills include legal research, writing, oral advocacy, and client counseling. Specialization in areas like tax, patent (requires technical background), or corporate law can significantly impact earning potential. Strong analytical thinking, attention to detail, and communication skills are critical. Many lawyers pursue additional certifications or LLM degrees in specialized areas.",
        "careerGrowth": "Career path varies dramatically by sector. BigLaw: Associate (0-8 years, $190K-$365K) → Partner (9+ years, $500K-$2M+). Mid-size firms: Associate (0-6 years, $80K-$150K) → Partner (7+ years, $200K-$600K). Government/Public Interest: Attorney (varies, $60K-$120K) → Senior Attorney or Supervisor (varies, $100K-$150K). Many lawyers transition into corporate in-house roles, offering better work-life balance. The field offers high earning potential but requires significant educational investment ($150K-$250K in law school debt is common) and often demanding hours, particularly in large firms. Job satisfaction varies widely by practice area and work environment."
    }
}