{
    "software-engineer": {
        "nationalOutlook": "According to the Bureau of Labor Statistics (Updated May 2025), software engineers earn a median annual salary of approximately $140,000, with top performers exceeding $225,000 in 2026. Employment is projected to grow 22% through 2030. Remote and AI-focused roles are seeing the highest premiums, especially in emerging tech hubs like Austin and Denver.",
        "skillRequirements": "Proficiency in AI/ML frameworks (TensorFlow, PyTorch), cloud platforms (AWS, Azure), and traditional languages (Python, Java) is critical for 2026. Data engineering skills are also highly valued.",
        "careerGrowth": "Junior ($90K-$120K) → Mid-level ($130K-$170K) → Senior/Staff ($180K-$300K+). Total compensation often includes significant equity in tech-centric cities."
    },
    "data-scientist": {
        "nationalOutlook": "Projected to grow 36% through 2030, data science remains one of the fastest-growing fields. Median salaries reached $135,000 in 2025, with specialized AI engineers commanding $250K+ in Hub-1 cities.",
        "skillRequirements": "Advanced SQL, Python, and Generative AI integration are the top skills for 2026. Masters degrees are still preferred but portfolio-based hiring is increasing.",
        "careerGrowth": "Data Scientist ($110K-$150K) → Senior ($160K-$220K) → Principal ($230K-$400K+). Demand is extreme in healthcare and fintech sectors."
    },
    "registered-nurse": {
        "nationalOutlook": "The nursing workforce continues to see high demand, with median wages rising to $95,000 in 2026. Specialized units (ICU, ER) and Travel Nursing contracts remain lucrative options.",
        "skillRequirements": "NCLEX-RN licensure is mandatory. BSN completion and specialized certifications (CCRN, CEN) provide 15-20% salary boosts.",
        "careerGrowth": "New Grad ($75K-$85K) → Specialized RN ($100K-$130K) → Nurse Practitioner ($140K-$180K+ in 2026)."
    },
    "lawyer": {
        "nationalOutlook": "Median wages across all legal sectors hit $155,000 in early 2026. Intellectual Property and Corporate Compliance are the highest growth areas.",
        "skillRequirements": "JD degree and Bar admission required. AI literacy for legal research is a major new requirement for top-tier firms.",
        "careerGrowth": "Associate ($100K-$250K) → Junior Partner ($300K-$600K) → Senior Partner/equity ($700K-$1M+)."
    },
    "chef": {
        "nationalOutlook": "Executive chefs and Head cooks see a median of $65,000 in 2026, though high-end hospitality in Tier 1 cities often exceeds $120,000. Demand is shifting towards upscale-casual dining.",
        "skillRequirements": "Culinary arts degree or equivalent experience. Certifications in food safety and kitchen management are standard.",
        "careerGrowth": "Sous Chef ($50K-$65K) → Executive Chef ($80K-$140K) → Restaurant Group Director ($150K+)."
    },
    "pilot": {
        "nationalOutlook": "Commercial pilots are in extreme demand in 2026, with median annual salaries jumping to $145,000. Major airline captains often exceed $350k total comp.",
        "skillRequirements": "Commercial pilot license (CPL) and ATP certification. Flight hours (1500+) are the primary barrier to entry.",
        "careerGrowth": "First Officer ($90K-$150K) → Captain ($250K-$400K). Seniority-based progression is the industry standard."
    },
    "financial-analyst": {
        "nationalOutlook": "Median salaries are approximately $92,000 in 2026. Fintech and sustainability/ESG reporting are the fastest-growing niches.",
        "skillRequirements": "CFA certification is the gold standard. Advanced financial modeling and data visualization (PowerBI, Tableau) are essential.",
        "careerGrowth": "Analyst ($75K-$95K) → Senior Analyst ($100K-$135K) → Portfolio Manager/Director ($180K-$300K+)."
    },
    "electrician": {
        "nationalOutlook": "Employment for electricians is projected to grow 9% through 2030, driven by the green energy transition and data center construction. Median wages are $68,000 in 2026.",
        "skillRequirements": "Apprenticeship and state licensure. Specialized skills in EV charging infrastructure or solar integration are highly valued.",
        "careerGrowth": "Journeyman ($60K-$90K) → Master Electrician ($100K-$150K) → Electrical Contractor ($200K+)."
    },
    "plumber": {
        "nationalOutlook": "Steady demand for infrastructure maintenance and green plumbing solutions. Median wages for 2026 are $66,000, with top earners in major metros surpassing $120k.",
        "skillRequirements": "Journeyman license required. Experience with water filtration and high-efficiency systems provides a competitive edge.",
        "careerGrowth": "Apprentice ($40K-$55K) → Licensed Plumber ($70K-$100K) → Business Owner ($150K-$300K+)."
    },
    "truck-driver": {
        "nationalOutlook": "Critical to the logistics chain, heavy truck drivers see median wages of $60,000 in 2026. E-commerce growth continues to drive consistent demand.",
        "skillRequirements": "CDL Class A license. Hazmat or double/triple endorsements significantly increase per-mile earning rates.",
        "careerGrowth": "Regional Driver ($55K-$75K) → Owner-Operator ($120K-$200K gross) → Fleet Manager ($90K-$130K)."
    },
    "marketing-manager": {
        "nationalOutlook": "Median salaries reached $159,000 in 2025. Demand for data-driven performance marketing and AI content specialists is surging as of 2026.",
        "skillRequirements": "Expertise in marketing automation, SEO, and AI content orchestration. Demonstrating ROI through data is the top expectation.",
        "careerGrowth": "Manager ($90K-$130K) → Director ($150K-$220K) → CMO ($250K-$500K+)."
    },
    "teacher": {
        "nationalOutlook": "The average annual pay for a teacher in the US is projected to hit $57,550 by early 2026. While state variations remain extreme, districts in high-growth areas (like Houston) are starting new teachers at $70,000+ to combat shortages.",
        "skillRequirements": "Strong classroom management, adaptability, and pedagogical literacy. Specialized certifications in STEM or Special Education provide significant salary leverage.",
        "careerGrowth": "Teacher ($55K-$85K) → Lead Teacher/Specialist ($90K-$110K) → School Administration ($120K-$160K+)."
    },
    "accountant": {
        "nationalOutlook": "Median salaries are expected to range from $64K to $123K in 2026. CPAs continue to command a 15-25% premium over non-certified peers. Job growth remains steady at 5% through 2034.",
        "skillRequirements": "CPA, CMA, or CFA certifications. Data analytics, ERP expertise, and AI fluency for financial reporting are the top requirements for 2026.",
        "careerGrowth": "Entry-level ($55K-$70K) → Senior/CPA ($80K-$120K) → Controller/CFO ($180K-$350K+)."
    },
    "police-officer": {
        "nationalOutlook": "Average salaries are projected at $61,000 in 2026, with top earners in high-cost states (CA, AK, CO) easily exceeding $80,000. Federal law enforcement is set for a 3.8% raise in early 2026.",
        "skillRequirements": "Problem-solving under pressure, physical fitness, and integrity. Specialized skills in cybersecurity or physical security are highly valued for federal roles.",
        "careerGrowth": "Officer ($60K-$85K) → Sergeant ($90K-$115K) → Lieutenant/Chief ($130K-$200K+)."
    },
    "sales-representative": {
        "nationalOutlook": "Average annual pay for sales reps is estimated at $76,700 in 2026, with Enterprise Account Executives often seeing OTE (On-Target Earnings) of $265K+. AI tech stack mastery is becoming a core requirement.",
        "skillRequirements": "Active listening, empathy, and AI fluency for prospecting. Mastery of CRM tools and storytelling are critical for closing high-value deals.",
        "careerGrowth": "SDR ($85K OTE) → AE ($130K-$175K OTE) → Enterprise AE ($265K+ OTE)."
    },
    "pharmacist": {
        "nationalOutlook": "Median annual salaries for pharmacists are projected at $137,500 in 2026. Ambulatory healthcare and hospital settings offer the highest premiums, often exceeding $150K.",
        "skillRequirements": "Doctor of Pharmacy (PharmD) and state licensure. Expertise in digital health tools and electronic medical records is essential for 2026.",
        "careerGrowth": "Staff Pharmacist ($115K-$140K) → Pharmacy Manager ($150K-$180K) → Director of Pharmacy ($190K+)."
    },
    "physical-therapist": {
        "nationalOutlook": "Physical therapist employment is projected to grow 11% through 2034. Median wages for 2026 are expected to reach $101,000, driven by an aging population and chronic condition management.",
        "skillRequirements": "DPT degree and state licensure. Strong communication, empathy, and manual therapy skills are the most demanded by employers.",
        "careerGrowth": "Physical Therapist ($80K-$105K) → Senior Therapist ($115K-$135K) → Practice Owner/Director ($150K+)."
    },
    "project-manager": {
        "nationalOutlook": "PMs in construction, tech, and healthcare earn a median of $110,000 in 2026. Professional certification (PMP) provides a consistent salary premium.",
        "skillRequirements": "PMP or PRINCE2 certification. Proficiency in Agile/Scrum methodologies and PM software (Jira, Asana) is standard.",
        "careerGrowth": "Project Manager ($90K-$120K) → Program Manager ($140K-$180K) → Director of PMO ($200K+)."
    },
    "travel-nurse": {
        "nationalOutlook": "Travel Nurses are the most mobile healthcare professionals in 2026, with median annual earnings of $135,000. Crisis rates and high-demand seasons in Tier 1 cities can push compensation much higher.",
        "skillRequirements": "Active RN license, multi-state Compact License (eNLC), and 2+ years of acute care experience. Flexibility and rapid adaptation are key soft skills.",
        "careerGrowth": "Staff RN → Travel RN → Specialized Travel Nurse (ICU/ER) → Travel Nurse Case Manager."
    },
    "management-consultant": {
        "nationalOutlook": "The consulting industry continues to see high geographic mobility. Median salaries for management consultants reach $125,000 in 2026, often supplemented by project bonuses.",
        "skillRequirements": "MBA or equivalent advanced degree. Strong analytical problem-solving, stakeholder management, and proficiency in data-driven decision tools.",
        "careerGrowth": "Associate Consultant ($85K-$110K) → Consultant ($120K-$160K) → Engagement Manager/Partner ($200K-$500K+)."
    },
    "petroleum-engineer": {
        "nationalOutlook": "As energy hubs shift, Petroleum Engineers maintain high mobility with a median salary of $165,000 in 2026. Demand remains high in Texas, North Dakota, and New Mexico.",
        "skillRequirements": "Degree in Petroleum or Chemical Engineering. Expertise in reservoir simulation software, drilling technologies, and environmental compliance.",
        "careerGrowth": "Junior Engineer ($95K-$120K) → Senior Reserve Engineer ($150K-$200K) → Operations Manager ($250K+)."
    },
    "cybersecurity-analyst": {
        "nationalOutlook": "Projected growth of 33% through 2030. Median salaries for cybersecurity analysts reached $120,000 in early 2026, with huge relocate-for-clearance demand.",
        "skillRequirements": "CISSP, CEH, or CompTIA Security+ certifications. Experience with cloud security architectures (AWS/Azure) and incident response is critical.",
        "careerGrowth": "Analyst ($90K-$120K) → Security Architect ($160K-$210K) → CISO ($250K-$450K+)."
    },
    "medical-resident": {
        "nationalOutlook": "Medical residents face a unique financial squeeze in 2026: median stipends average $68,000 while living in high-cost hospital hubs. 'The Match' forces thousands to relocate annually.",
        "skillRequirements": "MD or DO degree and matching into a residency program. Extreme resilience and time management are prerequisites for 80-hour work weeks.",
        "careerGrowth": "Intern ($64K) → Chief Resident ($75K) → Attending Physician ($240K+)."
    },
    "investment-banker": {
        "nationalOutlook": "Investment banking remains a high-stakes, high-reward field. 2026 base salaries for first-year analysts hover around $110K, with total comp often exceeding $175K in major hubs.",
        "skillRequirements": "Advanced financial modeling (LBO/DCF), Excel wizardry, and Series 7/63/79 licenses. Top-tier university pedigree is still highly favored.",
        "careerGrowth": "Analyst ($175K TC) → Associate ($300K TC) → VP ($500K TC) → Managing Director ($1M+)."
    },
    "lineman": {
        "nationalOutlook": "Electrical Linemen are the 'Travel Nurses' of the trades. Base pay averages $90K, but storm chasing and overtime push 2026 total compensation well over $150K for mobile workers.",
        "skillRequirements": "CDL Class A, OSHA 10 ET&D, and DOL Journeyman certification. Physical stamina for climbing and working in extreme weather is non-negotiable.",
        "careerGrowth": "Apprentice ($60K-$80K) → Journeyman Lineman ($110K-$200K w/ OT) → Troubleman/Foreman ($200K+)."
    }
}